from z3 import And, BoolRef, Not, Or, Select


def task_1(a, b, c) -> BoolRef:
    """Устраните ∃x: x >= a+2 ∧ x > b-1 ∧ 2x >= 2c+1 ∧ a+c <= b."""
    """a+c <= b ∧ ∃x: x >= a+2 ∧ x > b-1 ∧ 2x >= 2c+1."""
    """a+c <= b ∧ ∃x: x >= a+2 ∧ x >= b ∧ x >= c+1."""
    """a+c <= b ∧ ∃x: x >= max(a+2, b, c+1)"""
    """мы всегда найдем x который больше какого-то целого числа"""
    return a + c <= b


def task_2(a, b, c, d) -> BoolRef:
    """Устраните ∃x: a < 2x ∧ b <= x ∧ 2x < c ∧ x <= d."""
    """ ∃x: x >= [a/2] + 1 | x >= b | x <= [(c-1)/2] | x <= d."""
    """ Есть верхняя граница две правые клозы,
    есть нижняя граница две левые клозы"""
    """Каждая переменная от нижней границы меньше чем 
    переменные от верхней границы"""
    """a < 2x < c между a и c четное число"""
    return And(
        Or(c >= a + 3, And(c >= a + 2, (a + 1) % 2 == 0)),
        a < 2 * d,
        2 * b < c,
        b <= d 
    )


def task_3(a, b) -> BoolRef:
    """Устраните ∃x: a <= x ∧ x < b ∧ 2 | (x+1) ∧ 3 | (x-a)."""
    """ из делимости 2 на х+1 -> х нечетное
    из делимости 3 на х - а -> х = а + 3 * n
    a - нечет -> подходят x = а + 6 * n, n=0,1,2,3,4....
    а - чет -> x = а + 3 + 6 * n, n=0,1,2,3,4....
    """
    return Or(
        And(a % 2 == 1, a < b),
        And(a % 2 == 0, a + 3 < b)
    )


def task_4(A, B, i, j) -> BoolRef:
    """Уберите A=B из A=B ∧ A[i]=0 ∧ B[i+1]=1 ∧ B[j]=2."""
    return And(
        A[i] == 0,
        B[i + 1] == 1,
        B[j] == 2,

        A[i] == B[i],
        A[i + 1] == B[i + 1],
        A[j] == B[j],
    )


def task_5(A, B, C, i, j, k) -> BoolRef:
    """Уберите равенства массивов:

    A=B ∧ B=C ∧ A[i]=0 ∧ C[j]=1 ∧ B[k]=A[j] ∧ C[i+1]=B[i].
    |
    V
    A = B = C
    """
    return And(
        A[i] == 0,
        C[j] == 1,
        A[i] == B[i],
        A[i] == C[i],

        B[k] == A[j],
        A[j] == B[j],
        A[j] == C[j],
        B[k] == A[k],
        B[k] == C[k],

        B[i] == C[i + 1],
        C[i + 1] == B[i + 1],
        C[i + 1] == A[i + 1]
    )


def task_6(A, B, C, D, i, j, w) -> BoolRef:
    """Уберите равенства и неравенства массивов:

    A=B ∧ C=D ∧ A≠C ∧ B≠D ∧ A[i]=0 ∧ C[i]=0 ∧ B[j]=1 ∧ D[j]=1.
    Используйте переданный w как общий индекс-свидетель неравенств.
    """
    return And(
        A[i] == B[i], A[j] == B[j], A[w] == B[w],
        C[i] == D[i], C[j] == D[j], C[w] == D[w],
        A[w] != C[w],
        B[w] != D[w],
        A[i] == 0,
        C[i] == 0,
        B[j] == 1,
        D[j] == 1
    )
